In [1]:
import pandas as pd

In [3]:
x=pd.Series(['data','science','lab'])
print(x)

0       data
1    science
2        lab
dtype: object

In [4]:
date=pd.date_range('2021-05-01','2021-05-12')
print(pd.Series(date))

0    2021-05-01
1    2021-05-02
2    2021-05-03
3    2021-05-04
4    2021-05-05
5    2021-05-06
6    2021-05-07
7    2021-05-08
8    2021-05-09
9    2021-05-10
10   2021-05-11
11   2021-05-12
dtype: datetime64[ns]

In [5]:
details={ 'Name':['abc','def','xyz'],
          'Age':[21,22,23],
           'class':['cs','mca','btech'],
        }
df=pd.DataFrame(details)
df

  Name  Age  class
0  abc   21     cs
1  def   22    mca
2  xyz   23  btech

In [8]:
list=[['abc',23],['def',24],['xyz',21]]
df=pd.DataFrame(list,columns=['Tag','numbers'])
df

   Tag  numbers
0  abc       23
1  def       24
2  xyz       21

In [11]:
df=pd.read_csv('read.csv')
df

     name  age
0  midhun   23
1  sarath   24
2   ajsar   21

In [15]:
details={ 'Name':['abc','def','xyz'],
          'Age':[24,22,21],
           'class':['cs','mca','btech'],
        }
df=pd.DataFrame(details)
df

  Name  Age  class
0  abc   24     cs
1  def   22    mca
2  xyz   21  btech

In [14]:
print("Sorted data")
df.sort_values(by=['Age'])

Sorted data

  Name  Age  class
2  xyz   21  btech
1  def   22    mca
0  abc   24     cs

In [22]:
details={ 'Name':['abc','def','xyz'],
          'Age':[24,22,21],
           'class':['cs','mca','btech'],
        }
index={30,31,32}
df=pd.DataFrame(details,index)
print("Custom index")
df

Custom index

   Name  Age  class
32  abc   24     cs
30  def   22    mca
31  xyz   21  btech

In [24]:
df.reset_index(inplace=True,drop=True)
print("Index after reset")
df

Index after reset

  Name  Age  class
0  abc   24     cs
1  def   22    mca
2  xyz   21  btech

In [28]:
print("First two rows")
df=pd.DataFrame(details)
df2=df.head(2)
df2

First two rows

  Name  Age class
0  abc   24    cs
1  def   22   mca

In [ ]:
details={ 'Name':['abc','def','xyz'],
          'Occupation':['plumber','electrician','carpenter'],
           'salary':[15000,17000,16000]
        }
df=pd.DataFrame(details)